In [1]:
import pandas as pd

In [2]:
data = [[3, 'Brad', None, 4000], [1, 'John', 3, 1000], [2, 'Dan', 3, 2000], [4, 'Thomas', 3, 4000]]
employee = pd.DataFrame(data, columns=['empId', 'name', 'supervisor', 'salary']).astype({'empId':'Int64', 'name':'object', 'supervisor':'Int64', 'salary':'Int64'})
data = [[2, 500], [4, 2000]]
bonus = pd.DataFrame(data, columns=['empId', 'bonus']).astype({'empId':'Int64', 'bonus':'Int64'})

In [3]:
employee

   empId    name  supervisor  salary
0      3    Brad        <NA>    4000
1      1    John           3    1000
2      2     Dan           3    2000
3      4  Thomas           3    4000

In [4]:
bonus

   empId  bonus
0      2    500
1      4   2000

Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

Return the result table in any order.

The result format is in the following example.

| name | bonus |
|------|-------|
| Brad | null  |
| John | null  |
| Dan  | 500   |

In [6]:
t1=employee.merge(right=bonus, on="empId", how="left")[["name","bonus"]]
t1

     name  bonus
0    Brad   <NA>
1    John   <NA>
2     Dan    500
3  Thomas   2000

In [8]:
t1[(t1["bonus"]<1000)|(t1["bonus"].isnull())]

   name  bonus
0  Brad   <NA>
1  John   <NA>
2   Dan    500